#ifndef  DAC_H
#define DAC_H
#include "1986be9x_config.h"                                   //Стандартные.
#include "1986BE9x.h"

//---------------------------------------------------------
//ЦАП.
//---------------------------------------------------------
#define PCLK_EN(DAC)             (1<<18)                                //Маска включения тактирования ЦАП. 
#define CFG_Cfg_ON_DAC0          (1<<2)                                 //Маска включения ЦАП1.                    
#define CFG_Cfg_ON_DAC1          (1<<3)

//-------------------------------------------------
//Функции
//-------------------------------------------------
void DAC_Init (void);                                     //Инициализация DAC.
#endif