#ifndef  DMA_H
#define DMA_H
#include "1986be9x_config.h"                                   //Стандартные.
#include "1986BE9x.h"

//-------------------------------------------------
//Настройка структуры.
//-------------------------------------------------
#define dst_src       (3<<30)                      //Источник - 16 бит (полуслово).
#define src_inc       (1<<26)                      //Источник смещается на 16 бит после каждой передачи. 
#define src_size      (1<<24)                      //Отправляем по 16 бит.
#define dst_size      (1<<28)                      //Принимаем по 16 бит. Приемник и передатчик должны иметь одинаковые размерности.
#define n_minus_1     (49<<4)                      //50  передач (-1) DMA. 
#define cycle_ctrl    (3<<0)                       //Пинг-понг.

//-------------------------------------------------
//Маски бит.
//-------------------------------------------------
#define CFG_master_enable             (1<<0)      //Маска разрешает работу контроллера.
#define PCLK_EN_DMA                   (1<<5)      //Маска включает тактирование DMA.

//-------------------------------------------------
//Функции
//-------------------------------------------------
void DMA_to_DAC_and_TIM1 (void);                  //Настраиваем DMA для связки с DAC.
void Timer2_IRQHandler (void);                    //Прерывание от второго таймера по DAC.
#endif