#ifndef  PORT_H
#define PORT_H
#include "1986be9x_config.h"                                   //Стандартные.
#include "1986BE9x.h"

//---------------------------------------------------------
//Настраиваем выход, подключенный к усилителю. 
//---------------------------------------------------------
#define PER_CLOCK_PORTE              (1<<25)      //Бит включения тактирования порта E.
#define PORT_OE_OUT_PORTE_0          (1<<0)       //Включение этого бита переводит PORTE_0 в "выход". 
#define ANALOG_EN_DIGITAL_PORTE_0    (1<<0)       //Включаем цифровой режим бита порта PORTE_0.
#define PWR_MAX_PORTE_0              (3<<0)       //Включение данных бит переключает PORTE_0 в режим максимальной скорости.

#define PORT_RXTX_PORTE_0_OUT_1      (1<<0)       //Маска порта для подачи "1" на выход.

//-------------------------------------------------
//Функции
//-------------------------------------------------
void Buzzer_out_init (void);                      //Вывод усилителя в цифровом режиме.
void Buzzer_out_DAC_init (void);                  //Вывод усилителя для DAC2.
#endif